In [ ]:
import pip
pip.main(['install', 'pandas'])
pip.main(['install', 'matplotlib'])
pip.main(['install', 'seaborn'])
pip.main(['install', 'scikit-learn'])

Chargement des bibliothèques

In [4]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns

from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split
from sklearn.datasets import make_classification
from sklearn.metrics import roc_curve, auc
from sklearn.metrics import accuracy_score, classification_report, confusion_matrix
from sklearn.preprocessing import StandardScaler
from sklearn.preprocessing import OneHotEncoder
from sklearn.preprocessing import LabelEncoder

Chargement du jeu de données.

In [22]:
dataset_path = "C:\\Users\\belga\\OneDrive\\Bureau\\EMBA Big Data\\Module Datascience\\Projet Data Science S2 2024\\CODEINSEE.csv"
data6 = pd.read_csv(dataset_path, sep=';', low_memory=False,encoding='latin-1')
print(data6.shape)
print(list(data6.columns))

(39193, 5)
['#Code_commune_INSEE', 'Nom_de_la_commune', 'Code_postal', 'Libellé_d_acheminement', 'Ligne_5']

La ligne de code ci-dessous nous permet de connaître le détail des colonnes ainsi que le type de données constituant notre base (numérique ou caractères).

In [23]:
data6

,#Code_commune_INSEE,Nom_de_la_commune,Code_postal,Libellé_d_acheminement,Ligne_5
0,01001,L ABERGEMENT CLEMENCIAT,1400,L ABERGEMENT CLEMENCIAT,NaN
1,01002,L ABERGEMENT DE VAREY,1640,L ABERGEMENT DE VAREY,NaN
2,01004,AMBERIEU EN BUGEY,1500,AMBERIEU EN BUGEY,NaN
3,01005,AMBERIEUX EN DOMBES,1330,AMBERIEUX EN DOMBES,NaN
4,01006,AMBLEON,1300,AMBLEON,NaN
...,...,...,...,...,...
39188,98831,VOH,98883,OUACO,VOH
39189,98832,YATE,98834,YATE,NaN
39190,98833,KOUAOUA,98818,KOUAOUA,NaN
39191,98901,ILE DE CLIPPERTON,98799,ILE DE CLIPPERTON,NaN
39192,99138,MONACO,98000,MONACO,NaN

In [24]:
data6.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 39193 entries, 0 to 39192
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   #Code_commune_INSEE     39193 non-null  object
 1   Nom_de_la_commune       39193 non-null  object
 2   Code_postal             39193 non-null  int64
 3   Libellé_d_acheminement  39193 non-null  object
 4   Ligne_5                 4713 non-null   object
dtypes: int64(1), object(4)
memory usage: 1.5+ MB

Afin d'exploiter de façon optimale les informations, nous allons convetir les codes postaux en caractère. Nous n'avons pas nécessité à conserver ces valeurs en numérique.

In [27]:
data6['Code_postal'] = data6['Code_postal'].astype(str)

Vérification du traitement

In [28]:
data6.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 39193 entries, 0 to 39192
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   #Code_commune_INSEE     39193 non-null  object
 1   Nom_de_la_commune       39193 non-null  object
 2   Code_postal             39193 non-null  object
 3   Libellé_d_acheminement  39193 non-null  object
 4   Ligne_5                 39193 non-null  object
dtypes: object(5)
memory usage: 1.5+ MB

Suppression des colonnes dont les informations nous serons pas nécessairement utiles dans le cadre de notre projet.

In [29]:
data6.drop(columns=['Ligne_5'], inplace=True)

In [31]:
data6.drop(columns=['Libellé_d_acheminement'], inplace=True)

In [32]:
data6

      #Code_commune_INSEE        Nom_de_la_commune Code_postal
0                   01001  L ABERGEMENT CLEMENCIAT        1400
1                   01002    L ABERGEMENT DE VAREY        1640
2                   01004        AMBERIEU EN BUGEY        1500
3                   01005      AMBERIEUX EN DOMBES        1330
4                   01006                  AMBLEON        1300
...                   ...                      ...         ...
39188               98831                      VOH       98883
39189               98832                     YATE       98834
39190               98833                  KOUAOUA       98818
39191               98901        ILE DE CLIPPERTON       98799
39192               99138                   MONACO       98000

[39193 rows x 3 columns]

La ligne de code ci-dessous nous permet d'identifier les valeurs en doublons qui conviendra de traiter.

In [33]:
print(data6.duplicated().sum())
data6 = data6.drop_duplicates()

3624

Nous allons désormais procéder au traitement de ces doublons.

In [ ]:
data6.drop_duplicates(keep='first', inplace=True)

Code de vérification

In [35]:
print(data6.duplicated().sum())

0

Nous procédons également à la vérification de présence ou non de valeurs manquantes.

In [36]:
pd.DataFrame(index=data6.columns, columns=['%_missing_values'], data= (data6.isna().sum().values / len(data6)*100))

                     %_missing_values
#Code_commune_INSEE               0.0
Nom_de_la_commune                 0.0
Code_postal                       0.0

Le traitement des valeurs aberrantes ne concernant que les variables numériques, nous n'allons pas procéder à ce traitement car aucune de nos variables n'est concernées sur ce dataframe.